{
  "id": "PPR1110664",
  "source": "PPR",
  "doi": "10.1101/2025.10.24.25338314",
  "title": "Efficacy and Safety of Vitamin D for COVID-19: A Living Evidence Synthesis Baseline report",
  "authorString": "Sabalete T, Blasco JA, Rodríguez R, Rosario MP, Rojas-Reyes MX.",
  "authorList": {
    "author": [
      {
        "fullName": "Sabalete T",
        "firstName": "Trinidad",
        "lastName": "Sabalete",
        "initials": "T"
      },
      {
        "fullName": "Blasco JA",
        "firstName": "Juan Antonio",
        "lastName": "Blasco",
        "initials": "JA"
      },
      {
        "fullName": "Rodríguez R",
        "firstName": "Rocío",
        "lastName": "Rodríguez",
        "initials": "R"
      },
      {
        "fullName": "Rosario MP",
        "firstName": "Maria Piedad",
        "lastName": "Rosario",
        "initials": "MP"
      },
      {
        "fullName": "Rojas-Reyes MX",
        "firstName": "María Ximena",
        "lastName": "Rojas-Reyes",
        "initials": "MX"
      }
    ]
  },
  "dataLinksTagsList": {
    "dataLinkstag": [
      "altmetrics"
    ]
  },
  "pubYear": "2025",
  "abstractText": "<h4>ABSTRACT</h4>  <h4>Objective</h4>  This living systematic review aims to provide a timely, rigorous, and continuously updated summary of the available evidence on the effectiveness and safety of using high dose (>4.000 IU) of Vitamin D for the treatment of mild, moderate, or severe COVID-19, as well as in the prevention of progression to long COVID. <h4>Methods</h4>  We are conducting a Living Evidence Synthesis (LES) following the Living Evidence to Inform Health Decisions (LE-IHD) framework. A stepwise approach was used for evidence identification, beginning with the identification of existing systematic reviews to build an evidence matrix of relevant primary studies. We then searched for additional primary studies published after the latest search dates of the included reviews. The Epistemonikos L·OVE (Living OVerview of Evidence) platform supports screening and selection, assisted by automated classifiers. Regular automated searches are conducted across major databases (e.g., Cochrane, MEDLINE, EMBASE, CINAHL, PsycINFO, and others), and ongoing trials are manually searched every three months in international trial registries. Two reviewers independently screen all results. We included randomized controlled trials assessing the effect of high dose (>4.000 IU) of Vitamin D use in patients with moderate to severe COVID-19 on outcomes including all-cause mortality, COVID-19-related hospitalization, intensive care unit (ICU) admission, quality of life, adverse events associated with vitamin D use or hypervitaminosis D, length of hospital stay, and incidence of long COVID or post COVID condition. We assessed the risk of bias of included RCTs using RoB2 and applied the GRADE approach to assess the certainty of the evidence for the outcomes of interest. This is the baseline report of this Living Evidence Synthesis (LES), including studies identified up to 30  th November 2024. Based on its conclusions, we revisited the research question to determine whether it is suitable to continue in a “living” mode.  <h4>Results</h4>  We identified nine RCTs meeting our criteria for inclusion, all of them assessed the effect of high dose (>4.000 IU) of Vitamin D compared to no treatment (standard of care) or placebo. Four RCTs with a total 1086 patients, used cholecalciferol as a single oral bolus of ≥ 100,000 IU and other four RCTs with a total 444 patients, used cholecalciferol in daily regimen (> 4,000 and < 100,000 IU daily doses for at least 7 days). Only one used calcifediol for ICU admitted COVID 19 patients. We present evidence independently for these two products. Low certainty evidence suggests that the use of ≥ 100,000 IU of cholecalciferol as a single bolus may increase all-cause mortality (RR=1.44, 95%CI: 0.88−2.37) and resulted in no differences regarding ICU admission (RR 0.93, 95 % CI 0.70−1.23; 11 fewer per 1000 patients, 95 % CI from 47 fewer to 36 more), and little to no difference in length of hospital stay. Three studies with 538 patients provide very low certainty evidence that suggest little to no effect of ≥ 100,000 IU of cholecalciferol on adverse events (4 fewer per 1000 patients, 95 % CI from 69 fewer to 186 more; RR 0.96; 95 % CI 0.33-2.81). Low certainty of evidence suggests that  cholecalciferol in daily regimen (> 4000 and < 100000 IU daily doses, for >7 days) may reduce all-cause mortality (2 studies; 265 patients; RR 0.79, 95 % CI; 0.60 to 1.03) and may results in little to no difference in length of hospital stay and adverse events compared to not use Vitamin D. The evidence is very uncertain about the effect of  cholecalciferol in daily regimen on ICU admission (3 studies; 315 patients; RR 0.30, 95 % CI 0.08−1.18).  Finally, the evidence about the use of  calcifediol in COVID -19 patients is very uncertain about its effect on all outcomes of interest.  <h4>Conclusions</h4>  Current available evidence does not support the use of vitamin D supplements in patients with COVID-19. The evidence for either benefit or harm from vitamin D supplementation is of low to very low certainty, with no significant differences observed between the various interventions (bolus vs. daily regimen) or between the products assessed (cholecalciferol and calcifediol). Several ongoing trials may provide additional evidence to improve the certainty regarding the effects of vitamin D at varying dosages. This justifies the adoption of a Living Evidence approach to continuously monitor and update these conclusions as new data emerge. We will keep this review in a “living mode” until either (a) the certainty of the evidence for benefits and harms becomes moderate to high, or (b) 24 months of surveillance are completed, whichever comes first. The ongoing review focuses on high-dose vitamin D supplementation (>4,000 IU/day) for the prevention and treatment of severe COVID-19, including outcomes such as hospitalization, ICU admission, quality of life, all-cause mortality, and adverse events in patients with mild, moderate, or severe illness.",
  "pubTypeList": {
    "pubType": [
      "Preprint"
    ]
  },
  "bookOrReportDetails": {
    "publisher": "medRxiv",
    "yearOfPublication": 2025
  },
  "fullTextUrlList": {
    "fullTextUrl": [
      {
        "availability": "Free",
        "availabilityCode": "F",
        "documentStyle": "doi",
        "site": "DOI",
        "url": "https://doi.org/10.1101/2025.10.24.25338314"
      }
    ]
  },
  "isOpenAccess": "N",
  "inEPMC": "N",
  "inPMC": "N",
  "hasPDF": "N",
  "hasBook": "N",
  "hasSuppl": "N",
  "citedByCount": 0,
  "hasData": "N",
  "hasReferences": "N",
  "hasTextMinedTerms": "Y",
  "hasDbCrossReferences": "N",
  "hasLabsLinks": "Y",
  "hasEvaluations": "N",
  "authMan": "N",
  "epmcAuthMan": "N",
  "nihAuthMan": "N",
  "hasTMAccessionNumbers": "N",
  "dateOfCreation": "2025-10-31",
  "firstIndexDate": "2025-10-31",
  "firstPublicationDate": "2025-10-30"
}